// 云函数入口文件
const cloud = require('wx-server-sdk')

cloud.init()
const db = cloud.database();

// 云函数入口函数
exports.main = async (event, context) => {
  try {
    return await db.collection('dep').add({
      data:{
        dep:['请选择...','脑卒中中心消化内科','高干科','肝病门诊血液内科','心内科','老年病科','感染病科','肾内科','艾滋病诊疗中心内分泌科','呼吸内科','神经内科','皮肤科','急诊科','ICU产科','妇科','妇产科','口腔科','心脏大血管外科','神经外科','胸外科','普外科','心外科','泌尿外科','普外科','三病房微创神经外科','整形美容科','耳鼻咽喉头颈外科','介入血管科','影像科','介入治疗科','超声科','核医学科','放射科','肿瘤放疗科','精神心理科','中医科','针灸科','儿内科','骨外科','疼痛科','眼科','视光门诊全科','医学科','肿瘤综合门诊肿瘤内科'],
        hos_name: '哈尔滨医科大学附属第四医院'
      },
      success(res){
        console.log('添加成功')
      }
    })
      
  } catch (e) {
   console.log(e)
  }
}